Revit 2027 API
BuiltInFailures.SheetFailures.SheetScaleOverrideInvalid Property
 The scale override parameter can only contain text, numeric values are not supported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SheetScaleOverrideInvalid { get; }
Public Shared ReadOnly Property SheetScaleOverrideInvalid As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SheetScaleOverrideInvalid {
	FailureDefinitionId^ get ();
}
static member SheetScaleOverrideInvalid : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SheetFailures Class
Autodesk.Revit.DB Namespace